{
    "name": "TrainAnnouncements",
    "version": "0.1.1",
    "title": "Train announcements",
    "author": "boernsen-development",
    "factorio_version": "1.1",
    "dependencies": ["base"],
    "description": "This Factorio mod adds train announcements to the game when sitting in a train. Currently the following announcements are supported:\n\n* Next station (at configurable distance before the next station)\n* Final station (if any wait condition of the next station is one of: Passenger not present, Inactivity >= 0.5h)\n* Destination full\n* No path\n* Stopping at a red signal\n* Back on path (train continues after being interrupted)\n* Pleasant journey (train has been switched to automatic and starts to move)\n* Intermediate (at configurable distances before the next station)\n\nAnnouncements are available as text as well as sound and they are in English only for now. Both can be turned off individually if desired. The audio announcements have been generated using https://freetts.com. Various generic station names are included, which can be assigned to the actual station names of your game via the mod settings by copy & paste. These settings are savegame-wise and should also be in sync automatically for all players of a multiplayer game. The textual announcements do print the actual station names.\n\nAdditionally, a few jingles are included, which will be played before the announcement if configured. Unfortunately, there is no audio preview possible in the settings, so you will have to try the sounds or play them manually from the sounds folder in the mod's zip file.\n\nIf you play single player / locally only, you may add your own announcement sounds, e.g. from a recording, Youtube, freesound.org or any free text-to-speech service such as https://freetts.com .\n\nDISCLAIMER: If you use any included script, you do that on your own responsibility. I will not take any responsibility for any damage to or loss of any data caused by the script.\n\nTo add your own sounds extract the mod zip file (in Factorio folder/mods), remove the zip file (keep the folder) and then add your sounds as *.ogg files to the corresponding sub-folders (i.e. Factorio folder/mods/TrainAnnouncements_x.x.x/sounds/...). After that you will need to run the two scripts update_data_settings_locale.py and update_sound_durations.py (tested on Ubuntu only). This makes them available in the mod settings and stores the sound durations to avoid overlapping sounds. If you delete any of the existing sounds, Factorio might complain about missing default settings, so you might be better off to add your sounds in own sub-folders. BE WARNED that if you added custom sounds and the mod is updated, your sounds will be removed, so make sure to backup them before updating or maintain them in a separate folder and copy/update them after each mod update!"
}
