{
    "name": "TrainAnnouncements",
    "version": "0.0.1",
    "title": "Train announcements",
    "author": "boernsen2",
    "factorio_version": "1.1",
    "dependencies": ["base"],
    "description": "This Factorio mod adds train announcements to the game when sitting in a train. Announcements are available as text as well as sound and they are in English only for now. Both can be turned off individually if desired. The audio announcements include various generic station names, which have been generated using https://freetts.com. These generic station announcements can be assigned to the actual station names of your game via the mod settings by copy & paste. These settings are savegame-wise and should also be in sync automatically for all players of a multiplayer game. The textual announcements do print the actual station names.\n\nCurrently the following announcements are supported:\n\n* Next station (at configurable distance before the next station)\n* Final station (if any wait condition of the next station is one of: Passenger not present, Inactivity >= 0.5h)\n* Destination full\n* No path\n* Stopping at a red signal\n* Back on path (train continues after \"No path\" or \"Stopping at red signal\")\n* Pleasant journey (train has been switched to automatic and starts to move)\n* Intermediate (at configurable distances before the next station)\n\nAdditionally, a few jingles are included, which can be played before the announcement if configured. Unfortunately, there is no audio preview possible in the settings, so you will have to try the sounds or play them manually from the sounds folder in the mod's zip file.\n\nIf you are on Linux (possibly also MacOS) and play single player / local only, you might add your own announcement sounds, e.g. from a recording, Youtube, freesound.org or any free text-to-speech service such as https://freetts.com . Just extract the mod zip (in Factorio folder/mods), keep the folder, but remove the zip file and then add your sounds as *.ogg files to the corresponding sub-folders (Factorio folder/mods/TrainAnnouncements_x.x.x/sounds/...). After that you will need to run the script update_data_settings_locale.sh (tested on Linux only). This makes them available in the corresponding mod settings dropdowns. If you delete the existing sounds, Factorio might complain about missing default settings, so you might be better off to add your sounds in sub-folders. BE WARNED that if you added custom sounds and the mod is updated, your sounds will be removed, so make sure to backup them before updating!"
}
